Revit 2027 API
CustomFieldData.GetCustomFieldId Method
 Gets an unique identifier of the custom field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid GetCustomFieldId()
Public Function GetCustomFieldId As Guid
public:
Guid GetCustomFieldId()
member GetCustomFieldId : unit -> Guid
Return Value
Guid
 Returns an unique identifier of type of custom field.
See Also
Reference
CustomFieldData Class
Autodesk.Revit.DB Namespace